Revit 2020 API
TaskDialog.Id Property
 The Id of the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2011
Syntax
C#
public string Id { get; set; }
Visual Basic
Public Property Id As String
	Get
	Set
Visual C++
public:
property String^ Id {
	String^ get ();
	void set (String^ value);
}
Remarks
 Id is used as TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events.
See Also
TaskDialog Class
Autodesk.Revit.UI Namespace